# AreaReinforcementType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaReinforcement..::..AreaReinforcementType Property
AreaReinforcement Class See Also
---
Retrieves the type of the Area Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaReinforcementType AreaReinforcementType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AreaReinforcementType As AreaReinforcementType
	Get
```

Visual C++
---
```text
public:
property AreaReinforcementType^ AreaReinforcementType {
	AreaReinforcementType^ get ();
}
```

# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace